//============================================================================
// 
// [KARIHAIKEI.cpp]
// Author : 福田歩希
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "KARIHAIKEI.h"

//============================================================================
// デフォルトコンストラクタ
//============================================================================
KARIHAIKEI::KARIHAIKEI() :
	CObject_X{ static_cast<int>(LAYER::BACK) }	// 描画優先度を指定
{

}

//============================================================================
// デストラクタ
//============================================================================
KARIHAIKEI::~KARIHAIKEI()
{

}

//============================================================================
// 初期設定
//============================================================================
HRESULT KARIHAIKEI::Init()
{
	// 基底クラスの初期設定
	HRESULT hr = CObject_X::Init();

	return hr;
}

//============================================================================
// 終了処理
//============================================================================
void KARIHAIKEI::Uninit()
{
	// 基底クラスの終了処理
	CObject_X::Uninit();
}

//============================================================================
// 更新処理
//============================================================================
void KARIHAIKEI::Update()
{
	// 基底クラスの更新
	CObject_X::Update();
}

//============================================================================
// 描画処理
//============================================================================
void KARIHAIKEI::Draw()
{
	// 基底クラスの描画処理
	CObject_X::Draw();
}

//============================================================================
// 生成
//============================================================================
KARIHAIKEI* KARIHAIKEI::Create()
{
	// インスタンスを生成
	KARIHAIKEI* pBlock = DBG_NEW KARIHAIKEI;

	if (pBlock == nullptr)
	{ // 生成失敗
		assert(false);
	}

	// タイプを設定
	pBlock->SetType(TYPE::NONE);

	// 基底クラスの初期設定
	pBlock->Init();

	// 座標の設定
	pBlock->SetPos({ 0.0f, 0.0f, 1000.0f });

	// モデルを取得
	auto model = CModel_X_Manager::GetInstance()->GetModel(CModel_X_Manager::TYPE::KARIHAIKEI);

	// モデルを設定
	pBlock->BindModel(model);

	// サイズを設定
	pBlock->SetSize(model->size);

	// 描画される前に一度更新しておく
	pBlock->Update();

	return pBlock;
}