//============================================================================
// 
// ステージデバッグ、ヘッダファイル [stage_debug.h]
// Author : 福田歩希
// 
//============================================================================

#ifndef _STAGE_DEBUG_H_
#define _STAGE_DEBUG_H_	// 二重インクルード防止

//****************************************************
// インクルードファイル
//****************************************************
#include "scene.h"

//****************************************************
// ステージデバッグクラス
//****************************************************
class CStage_Debug : public CScene
{
public:

	CStage_Debug();// コンストラクタ
	~CStage_Debug();// デストラクタ

private:

	HRESULT Init() override;	// 初期設定
	void Uninit() override;		// 終了処理
	void Update() override;		// 更新処理
	void Draw() override;		// 描画処理
};

#endif // _STAGE_DEBUG_H_