////============================================================================
//// 
//// ストラクチャー管理、ヘッダファイル [structure.h]
//// Author : 福田歩希
//// 
////============================================================================
//
//#ifndef _STRUCTURE_H_
//#define _STRUCTURE_H_	// 二重インクルード防止
//
////****************************************************
//// インクルードファイル
////****************************************************
//#include "object.h"
//
////****************************************************
//// ストラクチャークラス
////****************************************************
//class CStructure
//{
//public:
//
//	CStructure();	// コンストラクタ
//	~CStructure();	// デストラクタ
//
//	HRESULT Init();	// 初期設定
//	void Uninit();	// 終了処理
//	
//	void RegisterStructure(CObject* pObj);	// ストラクチャーに登録
//	std::list<CObject*> GetStructure();		// ストラクチャーを取得
//
//private:
//
//	static std::list<CObject*> m_StructureList;	// ストラクチャーリスト
//};
//
//#endif // _OBJECT_H_