//============================================================================
// 
// バリアアンカー [barrier_anchor.cpp]
// Author : 福田歩希
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "barrier_anchor.h"

//============================================================================
// デフォルトコンストラクタ
//============================================================================
CBarrier_Anchor::CBarrier_Anchor() :
	CObject_X{ static_cast<int>(LAYER::MIDDLE) }
{

}

//============================================================================
// デストラクタ
//============================================================================
CBarrier_Anchor::~CBarrier_Anchor()
{

}

//============================================================================
// 初期設定
//============================================================================
HRESULT CBarrier_Anchor::Init()
{
	// 基底クラスの初期設定
	HRESULT hr = CObject_X::Init();

	return hr;
}

//============================================================================
// 終了処理
//============================================================================
void CBarrier_Anchor::Uninit()
{
	// 基底クラスの終了処理
	CObject_X::Uninit();
}

//============================================================================
// 更新処理
//============================================================================
void CBarrier_Anchor::Update()
{
	// 基底クラスの更新
	CObject_X::Update();
}

//============================================================================
// 描画処理
//============================================================================
void CBarrier_Anchor::Draw()
{
	// 基底クラスの描画処理
	CObject_X::Draw();
}

//============================================================================
// 生成
//============================================================================
CBarrier_Anchor* CBarrier_Anchor::Create(D3DXVECTOR3 Pos)
{
	// インスタンスを生成
	CBarrier_Anchor* pAnchor = DBG_NEW CBarrier_Anchor{};

	if (pAnchor == nullptr)
	{ // 生成失敗
		assert(false);
	}

	// タイプを設定
	pAnchor->SetType(TYPE::BARRIER_ANCHOR);

	// 基底クラスの初期設定
	pAnchor->Init();

	// 座標の設定
	pAnchor->SetPos(Pos);

	// モデルを取得
	auto Model{ CModel_X_Manager::GetInstance()->GetModel(CModel_X_Manager::TYPE::BARRIER_ANCHOR) };

	// モデルを設定
	pAnchor->BindModel(Model);

	// サイズを設定
	pAnchor->SetSize(Model->size);

	// 描画される前に一度更新しておく
	pAnchor->Update();

	return pAnchor;
}