//============================================================================
// 
// チャレンジ、ヘッダファイル [challenge.h]
// Author : 福田歩希
// 
//============================================================================

#ifndef _CHALLENGE_H_
#define _CHALLENGE_H_	// 二重インクルード防止

//****************************************************
// インクルードファイル
//****************************************************
#include "scene.h"

//****************************************************
// チャレンジクラス
//****************************************************
class CChallenge : public CScene
{
public:

	CChallenge();			// デフォルトコンストラクタ
	~CChallenge() override;	// デストラクタ

	HRESULT Init() override;	// 初期設定
	void Uninit() override;		// 終了処理
	void Update() override;		// 更新処理
	void Draw() override;		// 描画処理
};

#endif // _CHALLENGE_H_